the/README.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:nil \n:nil ^:t arch:headline
#+OPTIONS: author:t broken-links:nil c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:nil e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:nil title:t toc:t todo:t |:t
#+TITLE: The Heretic's Emacs config
#+AUTHOR: Jack Henahan
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+EXPORT_FILE_NAME: ../README

* Table of Contents                                                     :TOC:
- [[#the-heretics-emacs-config][The Heretic's Emacs Config]]
  - [[#appearance][Appearance]]
  - [[#auto-completion][Auto-completion]]
  - [[#binding-keys][Binding Keys]]
  - [[#syntax-checking][Syntax Checking]]
  - [[#clipboard-integration][Clipboard Integration]]

* The Heretic's Emacs Config
** Appearance
*** Basic Setup
This file has appearance tweaks that are unrelated to the color
theme. Menus, scroll bars, bells, cursors, and so on. See also
=the-theme=, which customizes the color theme specifically.

*** Fullscreen
I use =chunkwm= to manage most windows, including Emacs, so the native
fullscreen mode is unnecessary. It's also necessary to set pixelwise
frame resizing non-nil for a variety of window managers. I don't see
any particular harm in having it on, regardless of WM.

#+BEGIN_SRC emacs-lisp
  (the-with-operating-system macOS
    (setq ns-use-native-fullscreen nil))
  (setq frame-resize-pixelwise t)
#+END_SRC

*** Interface Cleanup
Emacs defaults are a nightmare of toolbars and scrollbars and such
nonsense. We'll turn all of that off.

#+BEGIN_SRC emacs-lisp
  (menu-bar-mode -1)
  (setq ring-bell-function #'ignore)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (blink-cursor-mode -1)
#+END_SRC

*** Keystroke Display
Display keystrokes in the echo area immediately, not after one
second. We can't set the delay to zero because somebody thought it
would be a good idea to have that value suppress keystroke display
entirely.

#+BEGIN_SRC emacs-lisp
  (setq echo-keystrokes 1e-6)
#+END_SRC

*** No Title Bars
I put a lot of effort into purging title bars from most of the
software I use on a regular basis (what a waste of real estate), and
in Emacs 26 (might really be 26.2 or so) this is built in. For earlier
versions, patches exist to get the same effect.

#+BEGIN_SRC emacs-lisp
  (if (version<= "26" emacs-version)
      (setq default-frame-alist '((undecorated . t))))
#+END_SRC

*** Fonts
I use Pragmata Pro everywhere, but I'll eventually figure out how to
deal with fonts properly and allow this to be specified.

*** Adjust font size by screen resolution
The biggest issue I have with multiple monitors is that the font size
is all over the place. The functions below just set up some reasonable
defaults and machinery to change the size depending on the resolution
of the monitor.

#+BEGIN_SRC emacs-lisp
  (defun the-fontify-frame (frame)
    (interactive)
    (the-with-windowed-emacs
      (if (> (x-display-pixel-width) 2000)
          (set-frame-parameter frame 'font "PragmataPro 22") ;; Cinema Display
        (set-frame-parameter frame 'font "PragmataPro 16"))))

  (defun the-fontify-this-frame ()
    (interactive)
    (the-fontify-frame nil))

  (defun the-fontify-idle ()
    (interactive)
    (the-fontify-this-frame)
    (run-with-idle-timer 1 t 'the-fontify-this-frame))

  (call-interactively 'the-fontify-idle)
#+END_SRC
** Auto-completion
*** Company
=company= provides an in-buffer autocompletion framework. It
allows for packages to define backends that supply completion
candidates, as well as optional documentation and source code. Then
Company allows for multiple frontends to display the candidates, such
as a tooltip menu. Company stands for "Complete Anything".

#+BEGIN_SRC emacs-lisp
  (defvar the-company-backends-global
    '(company-capf
      company-files
      (company-dabbrev-code company-keywords)
      company-dabbrev)
    "Values for `company-backends' used everywhere.
  If `company-backends' is overridden by The, then these
  backends will still be included.")
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package company
    :demand t
    :init (company-tng-configure-default)
    :config
    <<company-config>>
    :delight company-mode)
#+END_SRC


