the/README.tex
% Created 2018-01-11 Thu 09:22
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Jack Henahan}
\date{\today}
\title{The Heretic's Emacs config}
\hypersetup{
 pdfauthor={Jack Henahan},
 pdftitle={The Heretic's Emacs config},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 25.3.1 (Org mode 9.1.6)},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Appearance}
\label{sec:org2c601f1}
\subsection{Basic Setup}
\label{sec:orga7dcfe7}
This file has appearance tweaks that are unrelated to the color
theme. Menus, scroll bars, bells, cursors, and so on. See also
\texttt{the-theme}, which customizes the color theme specifically.

\subsection{Fullscreen}
\label{sec:org1110216}
I use \texttt{chunkwm} to manage most windows, including Emacs, so the native
fullscreen mode is unnecessary. It's also necessary to set pixelwise
frame resizing non-nil for a variety of window managers. I don't see
any particular harm in having it on, regardless of WM.

\begin{verbatim}
(the-with-operating-system macOS
  (setq ns-use-native-fullscreen nil))
(setq frame-resize-pixelwise t)
\end{verbatim}

\subsection{Interface Cleanup}
\label{sec:org7473f87}
Emacs defaults are a nightmare of toolbars and scrollbars and such
nonsense. We'll turn all of that off.

\begin{verbatim}
(menu-bar-mode -1)
(setq ring-bell-function #'ignore)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(blink-cursor-mode -1)
\end{verbatim}

\subsection{Keystroke Display}
\label{sec:orgf279716}
Display keystrokes in the echo area immediately, not after one
second. We can't set the delay to zero because somebody thought it
would be a good idea to have that value suppress keystroke display
entirely.

\begin{verbatim}
(setq echo-keystrokes 1e-6)
\end{verbatim}

\subsection{No Title Bars}
\label{sec:orgbcd6a96}
I put a lot of effort into purging title bars from most of the
software I use on a regular basis (what a waste of real estate), and
in Emacs 26 (might really be 26.2 or so) this is built in. For earlier
versions, patches exist to get the same effect.

\begin{verbatim}
(if (version<= "26" emacs-version)
    (setq default-frame-alist '((undecorated . t))))
\end{verbatim}

\subsection{Fonts}
\label{sec:orgb1aeb44}
I use Pragmata Pro everywhere, but I'll eventually figure out how to
deal with fonts properly and allow this to be specified.

\subsection{Adjust font size by screen resolution}
\label{sec:org14309ac}
The biggest issue I have with multiple monitors is that the font size
is all over the place. The functions below just set up some reasonable
defaults and machinery to change the size depending on the resolution
of the monitor.

\begin{verbatim}
(defun the-fontify-frame (frame)
  (interactive)
  (the-with-windowed-emacs
    (if (> (x-display-pixel-width) 2000)
        (set-frame-parameter frame 'font "PragmataPro 22") ;; Cinema Display
      (set-frame-parameter frame 'font "PragmataPro 16"))))

(defun the-fontify-this-frame ()
  (interactive)
  (the-fontify-frame nil))

(defun the-fontify-idle ()
  (interactive)
  (the-fontify-this-frame)
  (run-with-idle-timer 1 t 'the-fontify-this-frame))

(call-interactively 'the-fontify-idle)
\end{verbatim}
\section{Auto-completion}
\label{sec:org2efb629}
\subsection{Company}
\label{sec:orge2153e4}
\texttt{company} provides an in-buffer autocompletion framework. It
allows for packages to define backends that supply completion
candidates, as well as optional documentation and source code. Then
Company allows for multiple frontends to display the candidates, such
as a tooltip menu. Company stands for "Complete Anything".

\begin{verbatim}
(defvar the-company-backends-global
  '(company-capf
    company-files
    (company-dabbrev-code company-keywords)
    company-dabbrev)
  "Values for `company-backends' used everywhere.
If `company-backends' is overridden by The, then these
backends will still be included.")
\end{verbatim}

\begin{verbatim}
(use-package company
  :demand t
  :init (company-tng-configure-default)
  :config
  <<company-config>>
  :delight company-mode)
\end{verbatim}
