the/README.md

# Table of Contents

1.  [Appearance](#org5063954)
    1.  [Basic Setup](#org0a99960)
    2.  [Fullscreen](#orgb4bf4ce)
    3.  [Interface Cleanup](#org9db530b)
    4.  [Keystroke Display](#orgda5db7d)
    5.  [No Title Bars](#org0af0a56)
    6.  [Fonts](#orgb1c1ca0)
    7.  [Adjust font size by screen resolution](#org1cd1e0f)
2.  [Auto-completion](#org4d2f612)
    1.  [Company](#orgcf3c9c9)
    2.  [Company Settings](#orgc24bd73)
3.  [Binding Keys](#org701f7ed)
    1.  [Custom Prefix](#org6ba54be)
    2.  [`bind-key`](#org1e42f53)
4.  [Syntax Checking](#org9f6ac2c)
    1.  [Flycheck](#org2873af5)
        1.  [Settings](#org92c38b1)
        2.  [`use-package` declaration](#orgc6d2ba7)
5.  [Clipboard Integration](#org427143c)
    1.  [macOS integration](#org6870dfb)
    2.  [Inter-program paste](#orgb37bc85)



<a id="org5063954"></a>

# Appearance


<a id="org0a99960"></a>

## Basic Setup

This file has appearance tweaks that are unrelated to the color
theme. Menus, scroll bars, bells, cursors, and so on. See also
`the-theme`, which customizes the color theme specifically.


<a id="orgb4bf4ce"></a>

## Fullscreen

I use `chunkwm` to manage most windows, including Emacs, so the native
fullscreen mode is unnecessary. It's also necessary to set pixelwise
frame resizing non-nil for a variety of window managers. I don't see
any particular harm in having it on, regardless of WM.

    (the-with-operating-system macOS
      (setq ns-use-native-fullscreen nil))
    (setq frame-resize-pixelwise t)


<a id="org9db530b"></a>

## Interface Cleanup

Emacs defaults are a nightmare of toolbars and scrollbars and such
nonsense. We'll turn all of that off.

    (menu-bar-mode -1)
    (setq ring-bell-function #'ignore)
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (blink-cursor-mode -1)


<a id="orgda5db7d"></a>

## Keystroke Display

Display keystrokes in the echo area immediately, not after one
second. We can't set the delay to zero because somebody thought it
would be a good idea to have that value suppress keystroke display
entirely.

    (setq echo-keystrokes 1e-6)


<a id="org0af0a56"></a>

## No Title Bars

I put a lot of effort into purging title bars from most of the
software I use on a regular basis (what a waste of real estate), and
in Emacs 26 (might really be 26.2 or so) this is built in. For earlier
versions, patches exist to get the same effect.

    (if (version<= "26" emacs-version)
        (setq default-frame-alist '((undecorated . t))))


<a id="orgb1c1ca0"></a>

## Fonts

I use Pragmata Pro everywhere, but I'll eventually figure out how to
deal with fonts properly and allow this to be specified.


<a id="org1cd1e0f"></a>

## Adjust font size by screen resolution

The biggest issue I have with multiple monitors is that the font size
is all over the place. The functions below just set up some reasonable
defaults and machinery to change the size depending on the resolution
of the monitor.

    (defun the-fontify-frame (frame)
      (interactive)
      (the-with-windowed-emacs
        (if (> (x-display-pixel-width) 2000)
            (set-frame-parameter frame 'font "PragmataPro 22") ;; Cinema Display
          (set-frame-parameter frame 'font "PragmataPro 16"))))

    (defun the-fontify-this-frame ()
      (interactive)
      (the-fontify-frame nil))

    (defun the-fontify-idle ()
      (interactive)
      (the-fontify-this-frame)
      (run-with-idle-timer 1 t 'the-fontify-this-frame))

    (call-interactively 'the-fontify-idle)


<a id="org4d2f612"></a>

# Auto-completion


<a id="orgcf3c9c9"></a>

## Company

`company` provides an in-buffer autocompletion framework. It
allows for packages to define backends that supply completion
candidates, as well as optional documentation and source code. Then
Company allows for multiple frontends to display the candidates, such
as a tooltip menu. Company stands for "Complete Anything".

    (defvar the-company-backends-global
      '(company-capf
        company-files
        (company-dabbrev-code company-keywords)
        company-dabbrev)
      "Values for `company-backends' used everywhere.
    If `company-backends' is overridden by The, then these
    backends will still be included.")

    (use-package company
      :demand t
      :init (company-tng-configure-default)
      :config
      <<company-config>>
      :delight company-mode)
