the/README.tex
\section{Binding Keys}
\label{sec:org1bbe8c2}

\subsection{Custom Prefix}
\label{sec:orgd165ada}
There's a lot of room for keybindings, but we rely on a common prefix
for discoverability and to leave room for extension. This also makes
creating modal bindings later quite a bit easier.

\begin{verbatim}
(defcustom the-prefix "M-T"
  "Prefix key sequence for The-related keybindings.
This is a string as would be passed to `kbd'."
  :group 'the
  :type 'string)
\end{verbatim}

For convenience, we also have a function that will create binding
strings using our prefix. This mainly gets used in bind-key
declarations until I can figure out how to evaluate code in org-table
cells to make the whole thing more customizable.

\begin{verbatim}
(defun the-join-keys (&rest keys)
  "Join key sequences. Empty strings and nils are discarded.
\(the--join-keys \"M-P e\" \"e i\") => \"M-P e e i\"
\(the--join-keys \"M-P\" \"\" \"e i\") => \"M-P e i\""
  (string-join (remove "" (mapcar #'string-trim (remove nil keys))) " "))
\end{verbatim}


\subsection{\texttt{bind-key}}
\label{sec:orga173d2a}
\texttt{bind-key} is the prettier cousin of \texttt{define-key} and
\texttt{global-set-key}, as well as providing the \texttt{:bind} family of keywords
in \texttt{use-package},

\begin{verbatim}
(use-package bind-key)
\end{verbatim}
\section{Syntax Checking}
\label{sec:org1e8b7d3}
\subsection{Flycheck}
\label{sec:orgafdea54}
Flycheck provides a framework for in-buffer error and warning
highlighting, or more generally syntax checking. It comes with a large
number of checkers pre-defined, and other packages define more.

\subsubsection{Settings}
\label{sec:orgacdc45e}
\begin{enumerate}
\item Enable Flycheck Globally
\label{sec:orge6ca2d5}
Enable Flycheck in all buffers, but also allow for disabling it
per-buffer.

\begin{verbatim}
(global-flycheck-mode +1)
(put 'flycheck-mode 'safe-local-variable #'booleanp)
\end{verbatim}

\item Disable Flycheck in the modeline
\label{sec:org27ade91}
It's honestly more distracting than anything,

\begin{verbatim}
(setq flycheck-mode-line nil)
\end{verbatim}
\end{enumerate}

\subsubsection{\texttt{use-package} declaration}
\label{sec:orgfa5d416}
\begin{verbatim}
(use-package flycheck
  :defer 3
  :config
  <<flycheck-global>>
  <<no-flycheck-modeline>>
  )
\end{verbatim}
\section{Clipboard Integration}
\label{sec:org2cad67e}
\subsection{macOS integration}
\label{sec:org426ecc6}
Like mouse integration, clipboard integration
works properly in windowed Emacs but not in terminal Emacs (at
least by default). This code was originally based on \href{https://gist.github.com/the-kenny/267162}{1}, and then
modified based on \href{http://emacs.stackexchange.com/q/26471/12534}{2}.

\begin{verbatim}
(the-with-operating-system macOS
  (the-with-terminal-emacs
    (defvar the-clipboard-last-copy nil
      "The last text that was copied to the system clipboard.
This is used to prevent duplicate entries in the kill ring.")

    (defun the-clipboard-paste ()
      "Return the contents of the macOS clipboard, as a string."
      (let* (;; Setting `default-directory' to a directory that is
             ;; sure to exist means that this code won't error out
             ;; when the directory for the current buffer does not
             ;; exist.
             (default-directory "/")
             ;; Command pbpaste returns the clipboard contents as a
             ;; string.
             (text (shell-command-to-string "pbpaste")))
        ;; If this function returns nil then the system clipboard is
        ;; ignored and the first element in the kill ring (which, if
        ;; the system clipboard has not been modified since the last
        ;; kill, will be the same). Including this `unless' clause
        ;; prevents you from getting the same text yanked the first
        ;; time you run `yank-pop'. (Of course, this is less relevant
        ;; due to `counsel-yank-pop', but still arguably the correct
        ;; behavior.)
        (unless (string= text the-clipboard-last-copy)
          text)))

    (defun the-clipboard-copy (text)
      "Set the contents of the macOS clipboard to given TEXT string."
      (let* (;; Setting `default-directory' to a directory that is
             ;; sure to exist means that this code won't error out
             ;; when the directory for the current buffer does not
             ;; exist.
             (default-directory "/")
             ;; Setting `process-connection-type' makes Emacs use a pipe to
             ;; communicate with pbcopy, rather than a pty (which is
             ;; overkill).
             (process-connection-type nil)
             ;; The nil argument tells Emacs to discard stdout and
             ;; stderr. Note, we aren't using `call-process' here
             ;; because we want this command to be asynchronous.
             ;;
             ;; Command pbcopy writes stdin to the clipboard until it
             ;; receives EOF.
             (proc (start-process "pbcopy" nil "pbcopy")))
        (process-send-string proc text)
        (process-send-eof proc))
      (setq the-clipboard-last-copy text))

    (setq interprogram-paste-function #'the-clipboard-paste)
    (setq interprogram-cut-function #'the-clipboard-copy)))
\end{verbatim}
