the/README.md


<a id="org701f7ed"></a>

# Binding Keys


<a id="org6ba54be"></a>

## Custom Prefix

There's a lot of room for keybindings, but we rely on a common prefix
for discoverability and to leave room for extension. This also makes
creating modal bindings later quite a bit easier.

    (defcustom the-prefix "M-T"
      "Prefix key sequence for The-related keybindings.
    This is a string as would be passed to `kbd'."
      :group 'the
      :type 'string)

For convenience, we also have a function that will create binding
strings using our prefix. This mainly gets used in bind-key
declarations until I can figure out how to evaluate code in org-table
cells to make the whole thing more customizable.

    (defun the-join-keys (&rest keys)
      "Join key sequences. Empty strings and nils are discarded.
    \(the--join-keys \"M-P e\" \"e i\") => \"M-P e e i\"
    \(the--join-keys \"M-P\" \"\" \"e i\") => \"M-P e i\""
      (string-join (remove "" (mapcar #'string-trim (remove nil keys))) " "))


<a id="org1e42f53"></a>

## `bind-key`

`bind-key` is the prettier cousin of `define-key` and
`global-set-key`, as well as providing the `:bind` family of keywords
in `use-package`,

    (use-package bind-key)


<a id="org9f6ac2c"></a>

# Syntax Checking


<a id="org2873af5"></a>

## Flycheck

Flycheck provides a framework for in-buffer error and warning
highlighting, or more generally syntax checking. It comes with a large
number of checkers pre-defined, and other packages define more.


<a id="org92c38b1"></a>

### Settings

1.  Enable Flycheck Globally

    Enable Flycheck in all buffers, but also allow for disabling it
    per-buffer.

        (global-flycheck-mode +1)
        (put 'flycheck-mode 'safe-local-variable #'booleanp)

2.  Disable Flycheck in the modeline

    It's honestly more distracting than anything,

        (setq flycheck-mode-line nil)


<a id="orgc6d2ba7"></a>

### `use-package` declaration

    (use-package flycheck
      :defer 3
      :config
      <<flycheck-global>>
      <<no-flycheck-modeline>>
      )


<a id="org427143c"></a>

# Clipboard Integration


<a id="org6870dfb"></a>

## macOS integration

Like mouse integration, clipboard integration
works properly in windowed Emacs but not in terminal Emacs (at
least by default). This code was originally based on [1](https://gist.github.com/the-kenny/267162), and then
modified based on [2](http://emacs.stackexchange.com/q/26471/12534).

    (the-with-operating-system macOS
      (the-with-terminal-emacs
        (defvar the-clipboard-last-copy nil
          "The last text that was copied to the system clipboard.
    This is used to prevent duplicate entries in the kill ring.")

        (defun the-clipboard-paste ()
          "Return the contents of the macOS clipboard, as a string."
          (let* (;; Setting `default-directory' to a directory that is
                 ;; sure to exist means that this code won't error out
                 ;; when the directory for the current buffer does not
                 ;; exist.
                 (default-directory "/")
                 ;; Command pbpaste returns the clipboard contents as a
                 ;; string.
                 (text (shell-command-to-string "pbpaste")))
            ;; If this function returns nil then the system clipboard is
            ;; ignored and the first element in the kill ring (which, if
            ;; the system clipboard has not been modified since the last
            ;; kill, will be the same). Including this `unless' clause
            ;; prevents you from getting the same text yanked the first
            ;; time you run `yank-pop'. (Of course, this is less relevant
            ;; due to `counsel-yank-pop', but still arguably the correct
            ;; behavior.)
            (unless (string= text the-clipboard-last-copy)
              text)))

        (defun the-clipboard-copy (text)
          "Set the contents of the macOS clipboard to given TEXT string."
          (let* (;; Setting `default-directory' to a directory that is
                 ;; sure to exist means that this code won't error out
                 ;; when the directory for the current buffer does not
                 ;; exist.
                 (default-directory "/")
                 ;; Setting `process-connection-type' makes Emacs use a pipe to
                 ;; communicate with pbcopy, rather than a pty (which is
                 ;; overkill).
                 (process-connection-type nil)
                 ;; The nil argument tells Emacs to discard stdout and
                 ;; stderr. Note, we aren't using `call-process' here
                 ;; because we want this command to be asynchronous.
                 ;;
                 ;; Command pbcopy writes stdin to the clipboard until it
                 ;; receives EOF.
                 (proc (start-process "pbcopy" nil "pbcopy")))
            (process-send-string proc text)
            (process-send-eof proc))
          (setq the-clipboard-last-copy text))

        (setq interprogram-paste-function #'the-clipboard-paste)
        (setq interprogram-cut-function #'the-clipboard-copy)))
