the/README.tex

\subsection{Inter-program paste}
\label{sec:org08c7c7b}
If you have something on the system clipboard, and then kill something
in Emacs, then by default whatever you had on the system clipboard is
gone and there is no way to get it back. Setting the following option
makes it so that when you kill something in Emacs, whatever was
previously on the system clipboard is pushed into the kill ring. This
way, you can paste it with \texttt{yank-pop}.
\begin{verbatim}
(setq save-interprogram-paste-before-kill t)
\end{verbatim}
\end{document}
